2020/java-dynamic-proxy.org
#+TITLE:      Java 动态代理的简单使用和理解
#+AUTHOR:     rgb-24bit
#+EMAIL:      rgb-24bit@foxmail.com
#+DATE:       <2020-02-15 六>

* 目录                                                    :TOC_4_gh:noexport:
- [[#前言][前言]]
- [[#jdk-动态代理][JDK 动态代理]]
  - [[#代理类][代理类]]
- [[#cglib-动态代理][CGLIB 动态代理]]
  - [[#代理类-1][代理类]]
  - [[#spring-configuration][Spring @Configuration]]
- [[#小结][小结]]
- [[#结语][结语]]
- [[#footnotes][Footnotes]]

* 前言
  在 Java 中，动态代理是一个很常用的功能，虽然说一般不需要自己直接去用，但是了解它们是怎么回事还是很有必要的。

  这篇博客的主要内容便是 JDK 动态代理和 CGLIB 动态代理的简单使用和理解。

