2020/java-dynamic-proxy.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2021-03-07 周日 15:57 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Java 动态代理的简单使用和理解</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rgb-24bit">
<link rel="stylesheet" type="text/css" href="https://rgb-24bit.github.io/blog/misc/style.css">
<!-- Global site tag (gtag.js) - Google Analytics -->
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://rgb-24bit.github.io/blog/"> UP </a>
 |
 <a accesskey="H" href="https://rgb-24bit.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">Java 动态代理的简单使用和理解</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org021a896">1. 前言</a></li>
<li><a href="#org425f48c">2. JDK 动态代理</a>
<ul>
<li><a href="#org6b3b77b">2.1. 代理类</a></li>
</ul>
</li>
<li><a href="#org2331f09">3. CGLIB 动态代理</a>
<ul>
<li><a href="#org807dd83">3.1. 代理类</a></li>
<li><a href="#orge888cf0">3.2. Spring @Configuration</a></li>
</ul>
</li>
<li><a href="#org641a487">4. 小结</a></li>
<li><a href="#orgde8c197">5. 结语</a></li>
</ul>
</div>
</div>

<div id="outline-container-org021a896" class="outline-2">
<h2 id="org021a896"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
在 Java 中，动态代理是一个很常用的功能，虽然说一般不需要自己直接去用，但是了解它们是怎么回事还是很有必要的。
</p>

<p>
这篇博客的主要内容便是 JDK 动态代理和 CGLIB 动态代理的简单使用和理解。
</p>
</div>
</div>
