2020/java-dynamic-proxy.org
* JDK 动态代理
  JDK 动态代理依赖于 *接口* 来确定它需要代理的方法，使用时可以分为以下几个角色：
  + =TargetInterfaces= - 需要代理的目标接口（们），JDK 动态代理将会为这些接口的 *方法调用* 创建代理
  + =TargetObject= - 实现了目标接口的对象
  + =InvocationHandler= - *方法调用* 处理器，JDK 动态代理在内部通过 =InvocationHandler= 对象来处理目标方法的调用
  + =java.lang.reflect.Proxy= - 组装 =InvocationHandler= 和 =TargetObject=, 创建代理对象，创建出来的代理对象是它的子类的实例

  =TargetInterfaces= 和 =TargetObject= 相对来说很容易理解，就是一些接口和实现了这些接口的对象，比如说：
  #+begin_src java
    interface TargetInterfaceA {
      void targetMethodA();
    }

    interface TargetInterfaceB {
      void targetMethodB();
    }

    class TargetClass implements TargetInterfaceA, TargetInterfaceB {
      @Override
      public void targetMethodA() {
        System.out.println("Target method A...");
      }

      @Override
      public void targetMethodB() {
        System.out.println("Target method B...");
      }
    }
  #+end_src

  上面的例子中，目标接口为 =[TargetInterfaceA, TargetInterfaceB]=, 而目标对象就是 =TargetClass= 的 *实例*.

  现在，我们想要拦截 =TargetClass= 实现的接口的方法的调用，我们需要先通过 =InvocationHandler= 来定义代理逻辑：
  #+begin_src java
    class SimpleInvocationHandler implements InvocationHandler {
      private Object target;

      public SimpleInvocationHandler(Object target) {
        this.target = target;
      }

      @Override
      public Object invoke(Object proxy, Method method, Object[] args) throws Throwable {
        System.out.println(String.format("Before invocation method %s", method.getName()));
        Object result = method.invoke(target, args);
        System.out.println(String.format("After invocation method %s", method.getName()));
        return result;
      }
    }
  #+end_src
  
  =InvocationHandler= 这个接口只定义了一个方法 =invoke=, 该方法的参数为：
  + =proxy= - 代理对象实例，注意，不是 =TargetObject=, 是 =Proxy= 子类的实例，因此，我们需要在 =InvocationHandler= 实例内部持有 =TargetObject=
  + =method= - 要调用的方法
  + =args= - 方法调用参数

  有了 =InvocationHandler= 和 =TargetClass= 之后，我们就可以创建 =TargetObject= 并通过 =Proxy= 组装创建代理对象了，主要通过 =newProxyInstance= 方法完成：
  #+begin_src java
    TargetClass targetObject = new TargetClass();
    Proxy.newProxyInstance(targetObject.getClass().getClassLoader(), targetObject.getClass().getInterfaces(), new SimpleInvocationHandler(targetObject););
  #+end_src

  方法 =Proxy.newProxyInstance= 的参数为：
  + =ClassLoader= - 一个 =ClassLoader=, 简单的话直接用 =targetObject= 的 =ClassLoader= 就可以了
  + =Class<?>[]= - 要代理的接口数组，同样，直接获取 =targetObject= 实现的所有接口
  + =InvocationHandler= - 定义了方法调用处理逻辑的 =InvocationHandler=

  *PS*: 可以看到，创建代理对象的时候需要我们先创建 =TargetObject= 才行，而且还需要手动将 =TargetObject= 传递给 =InvocationHandler=, 很麻烦……

  完整代码和测试：
  #+begin_src java
    interface TargetInterfaceA {
        void targetMethodA();
    }

    interface TargetInterfaceB {
        void targetMethodB();
    }

    class TargetClass implements TargetInterfaceA, TargetInterfaceB {
        @Override
        public void targetMethodA() {
            System.out.println("Target method A...");
        }

        @Override
        public void targetMethodB() {
            System.out.println("Target method B...");
        }
    }

    class SimpleInvocationHandler implements InvocationHandler {
        private Object target;

        public SimpleInvocationHandler(Object target) {
            this.target = target;
        }

        public static Object bind(Object targetObject) {
            SimpleInvocationHandler handler = new SimpleInvocationHandler(targetObject);
            return Proxy.newProxyInstance(targetObject.getClass().getClassLoader(), targetObject.getClass().getInterfaces(), handler);
        }

        @Override
        public Object invoke(Object proxy, Method method, Object[] args) throws Throwable {
            System.out.println(String.format("Before invocation method %s", method.getName()));
            Object result = method.invoke(target, args);
            System.out.println(String.format("After invocation method %s", method.getName()));
            return result;
        }
    }

    public class ProxyTest {
      public static void main(String[] args) {
        Object proxy = SimpleInvocationHandler.bind(new TargetClass());
        ((TargetInterfaceA) proxy).targetMethodA();
        ((TargetInterfaceB) proxy).targetMethodB();
      }
    }
  #+end_src

  输出为：
  #+begin_example
    Before invocation method targetMethodA
    Target method A...
    After invocation method targetMethodA
    Before invocation method targetMethodB
    Target method B...
    After invocation method targetMethodB
  #+end_example

