2020/java-dynamic-proxy.html

<div id="outline-container-org425f48c" class="outline-2">
<h2 id="org425f48c"><span class="section-number-2">2</span> JDK 动态代理</h2>
<div class="outline-text-2" id="text-2">
<p>
JDK 动态代理依赖于 <b>接口</b> 来确定它需要代理的方法，使用时可以分为以下几个角色：
</p>
<ul class="org-ul">
<li><code>TargetInterfaces</code> - 需要代理的目标接口（们），JDK 动态代理将会为这些接口的 <b>方法调用</b> 创建代理</li>
<li><code>TargetObject</code> - 实现了目标接口的对象</li>
<li><code>InvocationHandler</code> - <b>方法调用</b> 处理器，JDK 动态代理在内部通过 <code>InvocationHandler</code> 对象来处理目标方法的调用</li>
<li><code>java.lang.reflect.Proxy</code> - 组装 <code>InvocationHandler</code> 和 <code>TargetObject</code>, 创建代理对象，创建出来的代理对象是它的子类的实例</li>
</ul>

<p>
<code>TargetInterfaces</code> 和 <code>TargetObject</code> 相对来说很容易理解，就是一些接口和实现了这些接口的对象，比如说：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">interface</span> <span class="org-type">TargetInterfaceA</span> {
  <span class="org-type">void</span> <span class="org-function-name">targetMethodA</span>();
}

<span class="org-keyword">interface</span> <span class="org-type">TargetInterfaceB</span> {
  <span class="org-type">void</span> <span class="org-function-name">targetMethodB</span>();
}

<span class="org-keyword">class</span> <span class="org-type">TargetClass</span> <span class="org-keyword">implements</span> <span class="org-type">TargetInterfaceA</span>, <span class="org-type">TargetInterfaceB</span> {
  <span class="org-c-annotation">@Override</span>
  <span class="org-keyword">public</span> <span class="org-type">void</span> <span class="org-function-name">targetMethodA</span>() {
    System.out.println(<span class="org-string">"Target method A..."</span>);
  }

  <span class="org-c-annotation">@Override</span>
  <span class="org-keyword">public</span> <span class="org-type">void</span> <span class="org-function-name">targetMethodB</span>() {
    System.out.println(<span class="org-string">"Target method B..."</span>);
  }
}
</pre>
</div>

<p>
上面的例子中，目标接口为 <code>[TargetInterfaceA, TargetInterfaceB]</code>, 而目标对象就是 <code>TargetClass</code> 的 <b>实例</b>.
</p>

<p>
现在，我们想要拦截 <code>TargetClass</code> 实现的接口的方法的调用，我们需要先通过 <code>InvocationHandler</code> 来定义代理逻辑：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">class</span> <span class="org-type">SimpleInvocationHandler</span> <span class="org-keyword">implements</span> <span class="org-type">InvocationHandler</span> {
  <span class="org-keyword">private</span> <span class="org-type">Object</span> <span class="org-variable-name">target</span>;

  <span class="org-keyword">public</span> <span class="org-function-name">SimpleInvocationHandler</span>(<span class="org-type">Object</span> <span class="org-variable-name">target</span>) {
    <span class="org-keyword">this</span>.target = target;
  }

  <span class="org-c-annotation">@Override</span>
  <span class="org-keyword">public</span> <span class="org-type">Object</span> <span class="org-function-name">invoke</span>(<span class="org-type">Object</span> <span class="org-variable-name">proxy</span>, <span class="org-type">Method</span> <span class="org-variable-name">method</span>, <span class="org-type">Object</span>[] <span class="org-variable-name">args</span>) <span class="org-keyword">throws</span> <span class="org-type">Throwable</span> {
    System.out.println(String.format(<span class="org-string">"Before invocation method %s"</span>, method.getName()));
    <span class="org-type">Object</span> <span class="org-variable-name">result</span> = method.invoke(target, args);
    System.out.println(String.format(<span class="org-string">"After invocation method %s"</span>, method.getName()));
    <span class="org-keyword">return</span> result;
  }
}
</pre>
</div>

<p>
<code>InvocationHandler</code> 这个接口只定义了一个方法 <code>invoke</code>, 该方法的参数为：
</p>
<ul class="org-ul">
<li><code>proxy</code> - 代理对象实例，注意，不是 <code>TargetObject</code>, 是 <code>Proxy</code> 子类的实例，因此，我们需要在 <code>InvocationHandler</code> 实例内部持有 <code>TargetObject</code></li>
<li><code>method</code> - 要调用的方法</li>
<li><code>args</code> - 方法调用参数</li>
</ul>

<p>
有了 <code>InvocationHandler</code> 和 <code>TargetClass</code> 之后，我们就可以创建 <code>TargetObject</code> 并通过 <code>Proxy</code> 组装创建代理对象了，主要通过 <code>newProxyInstance</code> 方法完成：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-type">TargetClass</span> <span class="org-variable-name">targetObject</span> = <span class="org-keyword">new</span> <span class="org-type">TargetClass</span>();
Proxy.newProxyInstance(targetObject.getClass().getClassLoader(), targetObject.getClass().getInterfaces(), <span class="org-keyword">new</span> <span class="org-type">SimpleInvocationHandler</span>(targetObject););
</pre>
</div>

<p>
方法 <code>Proxy.newProxyInstance</code> 的参数为：
</p>
<ul class="org-ul">
<li><code>ClassLoader</code> - 一个 <code>ClassLoader</code>, 简单的话直接用 <code>targetObject</code> 的 <code>ClassLoader</code> 就可以了</li>
<li><code>Class&lt;?&gt;[]</code> - 要代理的接口数组，同样，直接获取 <code>targetObject</code> 实现的所有接口</li>
<li><code>InvocationHandler</code> - 定义了方法调用处理逻辑的 <code>InvocationHandler</code></li>
</ul>

<p>
<b>PS</b>: 可以看到，创建代理对象的时候需要我们先创建 <code>TargetObject</code> 才行，而且还需要手动将 <code>TargetObject</code> 传递给 <code>InvocationHandler</code>, 很麻烦……
</p>

<p>
完整代码和测试：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">interface</span> <span class="org-type">TargetInterfaceA</span> {
    <span class="org-type">void</span> <span class="org-function-name">targetMethodA</span>();
}

<span class="org-keyword">interface</span> <span class="org-type">TargetInterfaceB</span> {
    <span class="org-type">void</span> <span class="org-function-name">targetMethodB</span>();
}

<span class="org-keyword">class</span> <span class="org-type">TargetClass</span> <span class="org-keyword">implements</span> <span class="org-type">TargetInterfaceA</span>, <span class="org-type">TargetInterfaceB</span> {
    <span class="org-c-annotation">@Override</span>
    <span class="org-keyword">public</span> <span class="org-type">void</span> <span class="org-function-name">targetMethodA</span>() {
        System.out.println(<span class="org-string">"Target method A..."</span>);
    }

    <span class="org-c-annotation">@Override</span>
    <span class="org-keyword">public</span> <span class="org-type">void</span> <span class="org-function-name">targetMethodB</span>() {
        System.out.println(<span class="org-string">"Target method B..."</span>);
    }
}

<span class="org-keyword">class</span> <span class="org-type">SimpleInvocationHandler</span> <span class="org-keyword">implements</span> <span class="org-type">InvocationHandler</span> {
    <span class="org-keyword">private</span> <span class="org-type">Object</span> <span class="org-variable-name">target</span>;

    <span class="org-keyword">public</span> <span class="org-function-name">SimpleInvocationHandler</span>(<span class="org-type">Object</span> <span class="org-variable-name">target</span>) {
        <span class="org-keyword">this</span>.target = target;
    }

    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">Object</span> <span class="org-function-name">bind</span>(<span class="org-type">Object</span> <span class="org-variable-name">targetObject</span>) {
        <span class="org-type">SimpleInvocationHandler</span> <span class="org-variable-name">handler</span> = <span class="org-keyword">new</span> <span class="org-type">SimpleInvocationHandler</span>(targetObject);
        <span class="org-keyword">return</span> Proxy.newProxyInstance(targetObject.getClass().getClassLoader(), targetObject.getClass().getInterfaces(), handler);
    }

    <span class="org-c-annotation">@Override</span>
    <span class="org-keyword">public</span> <span class="org-type">Object</span> <span class="org-function-name">invoke</span>(<span class="org-type">Object</span> <span class="org-variable-name">proxy</span>, <span class="org-type">Method</span> <span class="org-variable-name">method</span>, <span class="org-type">Object</span>[] <span class="org-variable-name">args</span>) <span class="org-keyword">throws</span> <span class="org-type">Throwable</span> {
        System.out.println(String.format(<span class="org-string">"Before invocation method %s"</span>, method.getName()));
        <span class="org-type">Object</span> <span class="org-variable-name">result</span> = method.invoke(target, args);
        System.out.println(String.format(<span class="org-string">"After invocation method %s"</span>, method.getName()));
        <span class="org-keyword">return</span> result;
    }
}

<span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">ProxyTest</span> {
  <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">main</span>(<span class="org-type">String</span>[] <span class="org-variable-name">args</span>) {
    <span class="org-type">Object</span> <span class="org-variable-name">proxy</span> = SimpleInvocationHandler.bind(<span class="org-keyword">new</span> <span class="org-type">TargetClass</span>());
    ((<span class="org-type">TargetInterfaceA</span>) proxy).targetMethodA();
    ((<span class="org-type">TargetInterfaceB</span>) proxy).targetMethodB();
  }
}
</pre>
</div>

<p>
输出为：
</p>
<pre class="example">
Before invocation method targetMethodA
Target method A...
After invocation method targetMethodA
Before invocation method targetMethodB
Target method B...
After invocation method targetMethodB
</pre>
</div>
