2020/java-dynamic-proxy.org
** 代理类
   在运行代码时可以将下面这行代码放在最前面查看 =Proxy= 动态生成的代理类是怎样的：
   #+begin_src java
     System.getProperties().put("sun.misc.ProxyGenerator.saveGeneratedFiles", "true");
   #+end_src

   前面的代码生成的代理类为：
   #+begin_src java
     final class $Proxy0 extends Proxy implements TargetInterfaceA, TargetInterfaceB {
       private static Method m0;
       private static Method m1;
       private static Method m2;
       private static Method m4;
       private static Method m3;

       static {
         try {
           m1 = Class.forName("java.lang.Object").getMethod("equals", Class.forName("java.lang.Object"));
           m2 = Class.forName("java.lang.Object").getMethod("toString");

           // 目标接口中定义的方法
           m4 = Class.forName("classload.TargetInterfaceB").getMethod("targetMethodB");
           m3 = Class.forName("classload.TargetInterfaceA").getMethod("targetMethodA");

           m0 = Class.forName("java.lang.Object").getMethod("hashCode");
         } catch (NoSuchMethodException var2) {
           throw new NoSuchMethodError(var2.getMessage());
         } catch (ClassNotFoundException var3) {
           throw new NoClassDefFoundError(var3.getMessage());
         }
       }

       public $Proxy0(InvocationHandler var1) throws  {
         super(var1);
       }

       // 通过 InvocationHandler 来调用目标方法
       public final void targetMethodA() throws  {
         try {
           super.h.invoke(this, m3, (Object[])null);
         } catch (RuntimeException | Error var2) {
           throw var2;
         } catch (Throwable var3) {
           throw new UndeclaredThrowableException(var3);
         }
       }

       // 通过 InvocationHandler 来调用目标方法
       public final void targetMethodB() throws  {
         try {
           super.h.invoke(this, m4, (Object[])null);
         } catch (RuntimeException | Error var2) {
           throw var2;
         } catch (Throwable var3) {
           throw new UndeclaredThrowableException(var3);
         }
       }
     }
   #+end_src

   通过阅读代理类的代码我们可以发现：
   + 代理类继承了 =Proxy= 并实现了目标接口
   + 代理类在静态初始化块通过反射获取了目标接口的方法
   + 代理类实现的接口方法会通过 =InvocationHandler= 来调用目标方法
   + =InvocationHandler= 传递的第一个参数为代理对象，不是 =TargetObject=[fn:1]

   另外，代理类还获取了 =Object= 的 hashCode、equals 和 toString 方法，它们的调用逻辑都是一样的，就是直接调用 =InvocationHandler= 对象对应的方法，比如：
   #+begin_src java
     public final int hashCode() throws  {
       try {
         return (Integer)super.h.invoke(this, m0, (Object[])null);
       } catch (RuntimeException | Error var2) {
         throw var2;
       } catch (Throwable var3) {
         throw new UndeclaredThrowableException(var3);
       }
     }
   #+end_src
   
   因此，我们也是可以代理目标对象的这些方法的。

* CGLIB 动态代理
  CGLIB 动态代理和 JDK 动态代理类似，只不过 CGLIB 动态代理是基于类的，不需要实现接口，简单使用的话只需要定义一个 =MethodInterceptor= 就可以了，
  相当于 JDK 动态代理中的 =InvocationHandler=.

  #+begin_src java
    class SimpleMethodInterceptor implements MethodInterceptor {
      @Override
      public Object intercept(Object obj, Method method, Object[] args, MethodProxy proxy) throws Throwable {
        System.out.println(String.format("Before invocation method %s", method.getName()));
        Object result = proxy.invokeSuper(obj, args);
        System.out.println(String.format("After invocation method %s", method.getName()));
        return result;
      }
    }
  #+end_src

  有了 =MethodInterceptor= 后我们就可以创建代理对象了：
  #+begin_src java
    class ProxyTest {
      public static void main(String[] args) {
        Enhancer enhancer = new Enhancer();
        // 设置需要被代理的类
        enhancer.setSuperclass(TargetClass.class);
        // 设置 MethodInterceptor
        enhancer.setCallback(new SimpleMethodInterceptor());
        // 创建代理对象
        TargetClass proxyObject = (TargetClass) enhancer.create();
        // 调用方法
        proxyObject.targetMethodA();
        proxyObject.targetMethodB();
      }
    }


    class TargetClass {
      public void targetMethodA() {
        System.out.println("Target method A...");
      }

      public void targetMethodB() {
        System.out.println("Target method B...");
      }
    }
  #+end_src

  执行输出为：
  #+begin_example
    Before invocation method targetMethodA
    Target method A...
    After invocation method targetMethodA
    Before invocation method targetMethodB
    Target method B...
    After invocation method targetMethodB
  #+end_example

