2020/java-dynamic-proxy.html

<div id="outline-container-org6b3b77b" class="outline-3">
<h3 id="org6b3b77b"><span class="section-number-3">2.1</span> 代理类</h3>
<div class="outline-text-3" id="text-2-1">
<p>
在运行代码时可以将下面这行代码放在最前面查看 <code>Proxy</code> 动态生成的代理类是怎样的：
</p>
<div class="org-src-container">
<pre class="src src-java">System.getProperties().put(<span class="org-string">"sun.misc.ProxyGenerator.saveGeneratedFiles"</span>, <span class="org-string">"true"</span>);
</pre>
</div>

<p>
前面的代码生成的代理类为：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">final</span> <span class="org-keyword">class</span> $Proxy0 <span class="org-keyword">extends</span> <span class="org-type">Proxy</span> <span class="org-keyword">implements</span> <span class="org-type">TargetInterfaceA</span>, <span class="org-type">TargetInterfaceB</span> {
  <span class="org-keyword">private</span> <span class="org-keyword">static</span> <span class="org-type">Method</span> <span class="org-variable-name">m0</span>;
  <span class="org-keyword">private</span> <span class="org-keyword">static</span> <span class="org-type">Method</span> <span class="org-variable-name">m1</span>;
  <span class="org-keyword">private</span> <span class="org-keyword">static</span> <span class="org-type">Method</span> <span class="org-variable-name">m2</span>;
  <span class="org-keyword">private</span> <span class="org-keyword">static</span> <span class="org-type">Method</span> <span class="org-variable-name">m4</span>;
  <span class="org-keyword">private</span> <span class="org-keyword">static</span> <span class="org-type">Method</span> <span class="org-variable-name">m3</span>;

  <span class="org-keyword">static</span> {
    <span class="org-keyword">try</span> {
      m1 = Class.forName(<span class="org-string">"java.lang.Object"</span>).getMethod(<span class="org-string">"equals"</span>, Class.forName(<span class="org-string">"java.lang.Object"</span>));
      m2 = Class.forName(<span class="org-string">"java.lang.Object"</span>).getMethod(<span class="org-string">"toString"</span>);

      <span class="org-comment-delimiter">// </span><span class="org-comment">&#30446;&#26631;&#25509;&#21475;&#20013;&#23450;&#20041;&#30340;&#26041;&#27861;</span>
      m4 = Class.forName(<span class="org-string">"classload.TargetInterfaceB"</span>).getMethod(<span class="org-string">"targetMethodB"</span>);
      m3 = Class.forName(<span class="org-string">"classload.TargetInterfaceA"</span>).getMethod(<span class="org-string">"targetMethodA"</span>);

      m0 = Class.forName(<span class="org-string">"java.lang.Object"</span>).getMethod(<span class="org-string">"hashCode"</span>);
    } <span class="org-keyword">catch</span> (<span class="org-type">NoSuchMethodException</span> <span class="org-variable-name">var2</span>) {
      <span class="org-keyword">throw</span> <span class="org-keyword">new</span> <span class="org-type">NoSuchMethodError</span>(var2.getMessage());
    } <span class="org-keyword">catch</span> (<span class="org-type">ClassNotFoundException</span> <span class="org-variable-name">var3</span>) {
      <span class="org-keyword">throw</span> <span class="org-keyword">new</span> <span class="org-type">NoClassDefFoundError</span>(var3.getMessage());
    }
  }

  <span class="org-keyword">public</span> $Proxy0(<span class="org-type">InvocationHandler</span> <span class="org-variable-name">var1</span>) <span class="org-keyword">throws</span>  {
    <span class="org-keyword">super</span>(var1);
  }

  <span class="org-comment-delimiter">// </span><span class="org-comment">&#36890;&#36807; InvocationHandler &#26469;&#35843;&#29992;&#30446;&#26631;&#26041;&#27861;</span>
  <span class="org-keyword">public</span> <span class="org-keyword">final</span> <span class="org-type">void</span> <span class="org-function-name">targetMethodA</span>() <span class="org-keyword">throws</span>  {
    <span class="org-keyword">try</span> {
      <span class="org-keyword">super</span>.h.invoke(<span class="org-keyword">this</span>, m3, (Object[])<span class="org-constant">null</span>);
    } <span class="org-keyword">catch</span> (RuntimeException | Error var2) {
      <span class="org-keyword">throw</span> var2;
    } <span class="org-keyword">catch</span> (<span class="org-type">Throwable</span> <span class="org-variable-name">var3</span>) {
      <span class="org-keyword">throw</span> <span class="org-keyword">new</span> <span class="org-type">UndeclaredThrowableException</span>(var3);
    }
  }

  <span class="org-comment-delimiter">// </span><span class="org-comment">&#36890;&#36807; InvocationHandler &#26469;&#35843;&#29992;&#30446;&#26631;&#26041;&#27861;</span>
  <span class="org-keyword">public</span> <span class="org-keyword">final</span> <span class="org-type">void</span> <span class="org-function-name">targetMethodB</span>() <span class="org-keyword">throws</span>  {
    <span class="org-keyword">try</span> {
      <span class="org-keyword">super</span>.h.invoke(<span class="org-keyword">this</span>, m4, (Object[])<span class="org-constant">null</span>);
    } <span class="org-keyword">catch</span> (RuntimeException | Error var2) {
      <span class="org-keyword">throw</span> var2;
    } <span class="org-keyword">catch</span> (<span class="org-type">Throwable</span> <span class="org-variable-name">var3</span>) {
      <span class="org-keyword">throw</span> <span class="org-keyword">new</span> <span class="org-type">UndeclaredThrowableException</span>(var3);
    }
  }
}
</pre>
</div>

<p>
通过阅读代理类的代码我们可以发现：
</p>
<ul class="org-ul">
<li>代理类继承了 <code>Proxy</code> 并实现了目标接口</li>
<li>代理类在静态初始化块通过反射获取了目标接口的方法</li>
<li>代理类实现的接口方法会通过 <code>InvocationHandler</code> 来调用目标方法</li>
<li><code>InvocationHandler</code> 传递的第一个参数为代理对象，不是 <code>TargetObject</code><sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup></li>
</ul>

<p>
另外，代理类还获取了 <code>Object</code> 的 hashCode、equals 和 toString 方法，它们的调用逻辑都是一样的，就是直接调用 <code>InvocationHandler</code> 对象对应的方法，比如：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">final</span> <span class="org-type">int</span> <span class="org-function-name">hashCode</span>() <span class="org-keyword">throws</span>  {
  <span class="org-keyword">try</span> {
    <span class="org-keyword">return</span> (Integer)<span class="org-keyword">super</span>.h.invoke(<span class="org-keyword">this</span>, m0, (Object[])<span class="org-constant">null</span>);
  } <span class="org-keyword">catch</span> (RuntimeException | Error var2) {
    <span class="org-keyword">throw</span> var2;
  } <span class="org-keyword">catch</span> (<span class="org-type">Throwable</span> <span class="org-variable-name">var3</span>) {
    <span class="org-keyword">throw</span> <span class="org-keyword">new</span> <span class="org-type">UndeclaredThrowableException</span>(var3);
  }
}
</pre>
</div>

<p>
因此，我们也是可以代理目标对象的这些方法的。
</p>
</div>
</div>
</div>

<div id="outline-container-org2331f09" class="outline-2">
<h2 id="org2331f09"><span class="section-number-2">3</span> CGLIB 动态代理</h2>
<div class="outline-text-2" id="text-3">
<p>
CGLIB 动态代理和 JDK 动态代理类似，只不过 CGLIB 动态代理是基于类的，不需要实现接口，简单使用的话只需要定义一个 <code>MethodInterceptor</code> 就可以了，相当于 JDK 动态代理中的 <code>InvocationHandler</code>.
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">class</span> <span class="org-type">SimpleMethodInterceptor</span> <span class="org-keyword">implements</span> <span class="org-type">MethodInterceptor</span> {
  <span class="org-c-annotation">@Override</span>
  <span class="org-keyword">public</span> <span class="org-type">Object</span> <span class="org-function-name">intercept</span>(<span class="org-type">Object</span> <span class="org-variable-name">obj</span>, <span class="org-type">Method</span> <span class="org-variable-name">method</span>, <span class="org-type">Object</span>[] <span class="org-variable-name">args</span>, <span class="org-type">MethodProxy</span> <span class="org-variable-name">proxy</span>) <span class="org-keyword">throws</span> <span class="org-type">Throwable</span> {
    System.out.println(String.format(<span class="org-string">"Before invocation method %s"</span>, method.getName()));
    <span class="org-type">Object</span> <span class="org-variable-name">result</span> = proxy.invokeSuper(obj, args);
    System.out.println(String.format(<span class="org-string">"After invocation method %s"</span>, method.getName()));
    <span class="org-keyword">return</span> result;
  }
}
</pre>
</div>

<p>
有了 <code>MethodInterceptor</code> 后我们就可以创建代理对象了：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">class</span> <span class="org-type">ProxyTest</span> {
  <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">main</span>(<span class="org-type">String</span>[] <span class="org-variable-name">args</span>) {
    <span class="org-type">Enhancer</span> <span class="org-variable-name">enhancer</span> = <span class="org-keyword">new</span> <span class="org-type">Enhancer</span>();
    <span class="org-comment-delimiter">// </span><span class="org-comment">&#35774;&#32622;&#38656;&#35201;&#34987;&#20195;&#29702;&#30340;&#31867;</span>
    enhancer.setSuperclass(TargetClass.<span class="org-keyword">class</span>);
    <span class="org-comment-delimiter">// </span><span class="org-comment">&#35774;&#32622; MethodInterceptor</span>
    enhancer.setCallback(<span class="org-keyword">new</span> <span class="org-type">SimpleMethodInterceptor</span>());
    <span class="org-comment-delimiter">// </span><span class="org-comment">&#21019;&#24314;&#20195;&#29702;&#23545;&#35937;</span>
    <span class="org-type">TargetClass</span> <span class="org-variable-name">proxyObject</span> = (<span class="org-type">TargetClass</span>) enhancer.create();
    <span class="org-comment-delimiter">// </span><span class="org-comment">&#35843;&#29992;&#26041;&#27861;</span>
    proxyObject.targetMethodA();
    proxyObject.targetMethodB();
  }
}


<span class="org-keyword">class</span> <span class="org-type">TargetClass</span> {
  <span class="org-keyword">public</span> <span class="org-type">void</span> <span class="org-function-name">targetMethodA</span>() {
    System.out.println(<span class="org-string">"Target method A..."</span>);
  }

  <span class="org-keyword">public</span> <span class="org-type">void</span> <span class="org-function-name">targetMethodB</span>() {
    System.out.println(<span class="org-string">"Target method B..."</span>);
  }
}
</pre>
</div>

<p>
执行输出为：
</p>
<pre class="example">
Before invocation method targetMethodA
Target method A...
After invocation method targetMethodA
Before invocation method targetMethodB
Target method B...
After invocation method targetMethodB
</pre>
</div>
