2020/java-dynamic-proxy.org
** 代理类
   对于 =CGLIB= 来说可以设置 =DebuggingClassWriter.DEBUG_LOCATION_PROPERTY= 属性的值来保存生成的代理类[fn:2]：
   #+begin_src java
     public class TargetClass$$EnhancerByCGLIB$$eb42b691 extends TargetClass implements Factory {
       private MethodInterceptor CGLIB$CALLBACK_0;

       static void CGLIB$STATICHOOK1() {
         // 要代理的目标方法
         var10000 = ReflectUtils.findMethods(new String[]{"targetMethodA", "()V", "targetMethodB", "()V"}, (var1 = Class.forName("TargetClass")).getDeclaredMethods());
         CGLIB$targetMethodA$0$Method = var10000[0];
         CGLIB$targetMethodA$0$Proxy = MethodProxy.create(var1, var0, "()V", "targetMethodA", "CGLIB$targetMethodA$0");
         CGLIB$targetMethodB$1$Method = var10000[1];
         CGLIB$targetMethodB$1$Proxy = MethodProxy.create(var1, var0, "()V", "targetMethodB", "CGLIB$targetMethodB$1");
       }

       // 目标方法的简单代理
       final void CGLIB$targetMethodA$0() {
         super.targetMethodA();
       }

       public final void targetMethodA() {
         MethodInterceptor var10000 = this.CGLIB$CALLBACK_0;
         if (var10000 == null) {
           CGLIB$BIND_CALLBACKS(this);
           var10000 = this.CGLIB$CALLBACK_0;
         }

         // 当 MethodInterceptor 不为空时通过 MethodInterceptor 调用目标方法
         if (var10000 != null) {
           var10000.intercept(this, CGLIB$targetMethodA$0$Method, CGLIB$emptyArgs, CGLIB$targetMethodA$0$Proxy);
         } else {
           super.targetMethodA();
         }
       }

       // 目标方法的简单代理
       final void CGLIB$targetMethodB$1() {
         super.targetMethodB();
       }

       public final void targetMethodB() {
         MethodInterceptor var10000 = this.CGLIB$CALLBACK_0;
         if (var10000 == null) {
           CGLIB$BIND_CALLBACKS(this);
           var10000 = this.CGLIB$CALLBACK_0;
         }

         // 当 MethodInterceptor 不为空时通过 MethodInterceptor 调用目标方法
         if (var10000 != null) {
           var10000.intercept(this, CGLIB$targetMethodB$1$Method, CGLIB$emptyArgs, CGLIB$targetMethodB$1$Proxy);
         } else {
           super.targetMethodB();
         }
       }

       final int CGLIB$hashCode$5() {
         return super.hashCode();
       }

       // 对 Object 方法的代理
       public final int hashCode() {
         MethodInterceptor var10000 = this.CGLIB$CALLBACK_0;
         if (var10000 == null) {
           CGLIB$BIND_CALLBACKS(this);
           var10000 = this.CGLIB$CALLBACK_0;
         }

         if (var10000 != null) {
           Object var1 = var10000.intercept(this, CGLIB$hashCode$5$Method, CGLIB$emptyArgs, CGLIB$hashCode$5$Proxy);
           return var1 == null ? 0 : ((Number)var1).intValue();
         } else {
           return super.hashCode();
         }
       }

       // ...
     }
   #+end_src

   可以看到
   + CGLIB 每个方法设置了两个代理，一个直接调用父类方法，另一个判断是否存在 =MethodInterceptor= 来进行调用
   + 代理类继承了 =TargetClass=, 和 JDK 动态代理中继承 =Proxy= 的方式不一样

   当我们设置了 =MethodInterceptor= 以后，CGLIB 便可以通过 =MethodInterceptor= 来调用目标方法，另外，调用 =MethodInterceptor.intercept= 方法时传递的第一个参数为代理类实例，
   因此，需要执行被代理的方法时，应该通过 =MethodProxy.invokeSuper= 来完成，如果使用 =Method.invoke= 的话就会导致无限递归调用。

** Spring @Configuration
   在使用 Spring 的时候我们可以通过如下方式定义 Bean：
   #+begin_src java
     @Configuration
     @ComponentScan(basePackageClasses = Company.class)
     public class Config {
       @Bean
       public Address getAddress() {
         return new Address("High Street", 1000);
       }

       @Bean
       public Person getPerson() {
         return new Person(getAddress());
       }
     }
   #+end_src

   当初对于这种方式的一种困惑就是，Spring 是怎么拦截对 =getAddress= 方法的调用的，因为在我的印象中 JDK 动态代理做不到这样的事情，现在才发现，Spring 会通过 CGLIB 为 =Config= 创建代理对象，拦截对 =getAddress= 方法的调用，保证 Bean 的单例性。

   因为在 Java 中会根据先对象的 *实际类型* 查找方法，找不到才到 *父类* 中进行查找，而恰好的是，CGLIB 创建的代理对象是覆盖了父类的方法的，这样一来，在代理类中通过 =MethodInterceptor= 拦截方法的调用就可以避免重复创建 Bean 了。

   这在 Spring 中对应的 =MethodInterceptor= 为 =ConfigurationClassEnhancer.BeanMethodInterceptor=.

* 小结
  这里汇总一下 JDK 动态代理和 CGLIB 动态代理的代理方式：
  + JDK 动态代理通过创建继承了 =Proxy= 并实现了 =TargetInterfaces= 的代理类来完成代理，调用 =TargetInterfaces= 的方法时，代理类会将方法调用转交给 =InvocationHandler= 完成
  + CGLIB 动态代理通过创建继承了 =TargetClass= 的代理类来完成代理，调用 =TargetClass= 的方法时，如果 =MethodInterceptor= 不为空，那么就会将方法调用转交给 =MethodInterceptor= 完成

  可以看到，两种实现动态代理的方式还是很接近的，只不过一个是通过接口，一个是通过子类。

* 结语
  最开始接触动态代理这个概念是在看《Java 核心技术卷》这本书的时候，当时刚开始学 Java 没多久，看到这个东西后的想法就是，这么不方便的东西，
  谁没事会去用啊 ‍→_→
  
  结果，它的使用很广泛 ‍( ´_ゝ｀)

  类似的还有源码注解，不得不说，这些操作起来麻烦，但是功能又强大的特性，总会有人完成花样来‍╮(￣▽￣)╭

* Footnotes

[fn:1] 最开始看到 =InvocationHandler= 这个接口的时候总以为它的第一个参数为 =TargetObject=

[fn:2] 为了方便阅读省略了很多其他不必要的内容 

