2020/java-dynamic-proxy.html

<div id="outline-container-org807dd83" class="outline-3">
<h3 id="org807dd83"><span class="section-number-3">3.1</span> 代理类</h3>
<div class="outline-text-3" id="text-3-1">
<p>
对于 <code>CGLIB</code> 来说可以设置 <code>DebuggingClassWriter.DEBUG_LOCATION_PROPERTY</code> 属性的值来保存生成的代理类<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">TargetClass$$EnhancerByCGLIB$$eb42b691</span> <span class="org-keyword">extends</span> <span class="org-type">TargetClass</span> <span class="org-keyword">implements</span> <span class="org-type">Factory</span> {
  <span class="org-keyword">private</span> <span class="org-type">MethodInterceptor</span> <span class="org-variable-name">CGLIB$CALLBACK_0</span>;

  <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">CGLIB$STATICHOOK1</span>() {
    <span class="org-comment-delimiter">// </span><span class="org-comment">&#35201;&#20195;&#29702;&#30340;&#30446;&#26631;&#26041;&#27861;</span>
    var10000 = ReflectUtils.findMethods(<span class="org-keyword">new</span> <span class="org-type">String</span>[]{<span class="org-string">"targetMethodA"</span>, <span class="org-string">"()V"</span>, <span class="org-string">"targetMethodB"</span>, <span class="org-string">"()V"</span>}, (var1 = Class.forName(<span class="org-string">"TargetClass"</span>)).getDeclaredMethods());
    CGLIB$targetMethodA$0$Method = var10000[0];
    CGLIB$targetMethodA$0$Proxy = MethodProxy.create(var1, var0, <span class="org-string">"()V"</span>, <span class="org-string">"targetMethodA"</span>, <span class="org-string">"CGLIB$targetMethodA$0"</span>);
    CGLIB$targetMethodB$1$Method = var10000[1];
    CGLIB$targetMethodB$1$Proxy = MethodProxy.create(var1, var0, <span class="org-string">"()V"</span>, <span class="org-string">"targetMethodB"</span>, <span class="org-string">"CGLIB$targetMethodB$1"</span>);
  }

  <span class="org-comment-delimiter">// </span><span class="org-comment">&#30446;&#26631;&#26041;&#27861;&#30340;&#31616;&#21333;&#20195;&#29702;</span>
  <span class="org-keyword">final</span> <span class="org-type">void</span> <span class="org-function-name">CGLIB$targetMethodA$0</span>() {
    <span class="org-keyword">super</span>.targetMethodA();
  }

  <span class="org-keyword">public</span> <span class="org-keyword">final</span> <span class="org-type">void</span> <span class="org-function-name">targetMethodA</span>() {
    <span class="org-type">MethodInterceptor</span> <span class="org-variable-name">var10000</span> = <span class="org-keyword">this</span>.CGLIB$CALLBACK_0;
    <span class="org-keyword">if</span> (var10000 == <span class="org-constant">null</span>) {
      CGLIB$BIND_CALLBACKS(<span class="org-keyword">this</span>);
      var10000 = <span class="org-keyword">this</span>.CGLIB$CALLBACK_0;
    }

    <span class="org-comment-delimiter">// </span><span class="org-comment">&#24403; MethodInterceptor &#19981;&#20026;&#31354;&#26102;&#36890;&#36807; MethodInterceptor &#35843;&#29992;&#30446;&#26631;&#26041;&#27861;</span>
    <span class="org-keyword">if</span> (var10000 != <span class="org-constant">null</span>) {
      var10000.intercept(<span class="org-keyword">this</span>, CGLIB$targetMethodA$0$Method, CGLIB$emptyArgs, CGLIB$targetMethodA$0$Proxy);
    } <span class="org-keyword">else</span> {
      <span class="org-keyword">super</span>.targetMethodA();
    }
  }

  <span class="org-comment-delimiter">// </span><span class="org-comment">&#30446;&#26631;&#26041;&#27861;&#30340;&#31616;&#21333;&#20195;&#29702;</span>
  <span class="org-keyword">final</span> <span class="org-type">void</span> <span class="org-function-name">CGLIB$targetMethodB$1</span>() {
    <span class="org-keyword">super</span>.targetMethodB();
  }

  <span class="org-keyword">public</span> <span class="org-keyword">final</span> <span class="org-type">void</span> <span class="org-function-name">targetMethodB</span>() {
    <span class="org-type">MethodInterceptor</span> <span class="org-variable-name">var10000</span> = <span class="org-keyword">this</span>.CGLIB$CALLBACK_0;
    <span class="org-keyword">if</span> (var10000 == <span class="org-constant">null</span>) {
      CGLIB$BIND_CALLBACKS(<span class="org-keyword">this</span>);
      var10000 = <span class="org-keyword">this</span>.CGLIB$CALLBACK_0;
    }

    <span class="org-comment-delimiter">// </span><span class="org-comment">&#24403; MethodInterceptor &#19981;&#20026;&#31354;&#26102;&#36890;&#36807; MethodInterceptor &#35843;&#29992;&#30446;&#26631;&#26041;&#27861;</span>
    <span class="org-keyword">if</span> (var10000 != <span class="org-constant">null</span>) {
      var10000.intercept(<span class="org-keyword">this</span>, CGLIB$targetMethodB$1$Method, CGLIB$emptyArgs, CGLIB$targetMethodB$1$Proxy);
    } <span class="org-keyword">else</span> {
      <span class="org-keyword">super</span>.targetMethodB();
    }
  }

  <span class="org-keyword">final</span> <span class="org-type">int</span> <span class="org-function-name">CGLIB$hashCode$5</span>() {
    <span class="org-keyword">return</span> <span class="org-keyword">super</span>.hashCode();
  }

  <span class="org-comment-delimiter">// </span><span class="org-comment">&#23545; Object &#26041;&#27861;&#30340;&#20195;&#29702;</span>
  <span class="org-keyword">public</span> <span class="org-keyword">final</span> <span class="org-type">int</span> <span class="org-function-name">hashCode</span>() {
    <span class="org-type">MethodInterceptor</span> <span class="org-variable-name">var10000</span> = <span class="org-keyword">this</span>.CGLIB$CALLBACK_0;
    <span class="org-keyword">if</span> (var10000 == <span class="org-constant">null</span>) {
      CGLIB$BIND_CALLBACKS(<span class="org-keyword">this</span>);
      var10000 = <span class="org-keyword">this</span>.CGLIB$CALLBACK_0;
    }

    <span class="org-keyword">if</span> (var10000 != <span class="org-constant">null</span>) {
      <span class="org-type">Object</span> <span class="org-variable-name">var1</span> = var10000.intercept(<span class="org-keyword">this</span>, CGLIB$hashCode$5$Method, CGLIB$emptyArgs, CGLIB$hashCode$5$Proxy);
      <span class="org-keyword">return</span> var1 == <span class="org-constant">null</span> ? 0 : ((<span class="org-type">Number</span>)var1).intValue();
    } <span class="org-keyword">else</span> {
      <span class="org-keyword">return</span> <span class="org-keyword">super</span>.hashCode();
    }
  }

  <span class="org-comment-delimiter">// </span><span class="org-comment">...</span>
}
</pre>
</div>

<p>
可以看到
</p>
<ul class="org-ul">
<li>CGLIB 每个方法设置了两个代理，一个直接调用父类方法，另一个判断是否存在 <code>MethodInterceptor</code> 来进行调用</li>
<li>代理类继承了 <code>TargetClass</code>, 和 JDK 动态代理中继承 <code>Proxy</code> 的方式不一样</li>
</ul>

<p>
当我们设置了 <code>MethodInterceptor</code> 以后，CGLIB 便可以通过 <code>MethodInterceptor</code> 来调用目标方法，另外，调用 <code>MethodInterceptor.intercept</code> 方法时传递的第一个参数为代理类实例，因此，需要执行被代理的方法时，应该通过 <code>MethodProxy.invokeSuper</code> 来完成，如果使用 <code>Method.invoke</code> 的话就会导致无限递归调用。
</p>
</div>
</div>

<div id="outline-container-orge888cf0" class="outline-3">
<h3 id="orge888cf0"><span class="section-number-3">3.2</span> Spring @Configuration</h3>
<div class="outline-text-3" id="text-3-2">
<p>
在使用 Spring 的时候我们可以通过如下方式定义 Bean：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-c-annotation">@Configuration</span>
<span class="org-c-annotation">@ComponentScan</span>(basePackageClasses = Company.<span class="org-keyword">class</span>)
<span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Config</span> {
  <span class="org-c-annotation">@Bean</span>
  <span class="org-keyword">public</span> <span class="org-type">Address</span> <span class="org-function-name">getAddress</span>() {
    <span class="org-keyword">return</span> <span class="org-keyword">new</span> <span class="org-type">Address</span>(<span class="org-string">"High Street"</span>, 1000);
  }

  <span class="org-c-annotation">@Bean</span>
  <span class="org-keyword">public</span> <span class="org-type">Person</span> <span class="org-function-name">getPerson</span>() {
    <span class="org-keyword">return</span> <span class="org-keyword">new</span> <span class="org-type">Person</span>(getAddress());
  }
}
</pre>
</div>

<p>
当初对于这种方式的一种困惑就是，Spring 是怎么拦截对 <code>getAddress</code> 方法的调用的，因为在我的印象中 JDK 动态代理做不到这样的事情，现在才发现，Spring 会通过 CGLIB 为 <code>Config</code> 创建代理对象，拦截对 <code>getAddress</code> 方法的调用，保证 Bean 的单例性。
</p>

<p>
因为在 Java 中会根据先对象的 <b>实际类型</b> 查找方法，找不到才到 <b>父类</b> 中进行查找，而恰好的是，CGLIB 创建的代理对象是覆盖了父类的方法的，这样一来，在代理类中通过 <code>MethodInterceptor</code> 拦截方法的调用就可以避免重复创建 Bean 了。
</p>

<p>
这在 Spring 中对应的 <code>MethodInterceptor</code> 为 <code>ConfigurationClassEnhancer.BeanMethodInterceptor</code>.
</p>
</div>
</div>
</div>

<div id="outline-container-org641a487" class="outline-2">
<h2 id="org641a487"><span class="section-number-2">4</span> 小结</h2>
<div class="outline-text-2" id="text-4">
<p>
这里汇总一下 JDK 动态代理和 CGLIB 动态代理的代理方式：
</p>
<ul class="org-ul">
<li>JDK 动态代理通过创建继承了 <code>Proxy</code> 并实现了 <code>TargetInterfaces</code> 的代理类来完成代理，调用 <code>TargetInterfaces</code> 的方法时，代理类会将方法调用转交给 <code>InvocationHandler</code> 完成</li>
<li>CGLIB 动态代理通过创建继承了 <code>TargetClass</code> 的代理类来完成代理，调用 <code>TargetClass</code> 的方法时，如果 <code>MethodInterceptor</code> 不为空，那么就会将方法调用转交给 <code>MethodInterceptor</code> 完成</li>
</ul>

<p>
可以看到，两种实现动态代理的方式还是很接近的，只不过一个是通过接口，一个是通过子类。
</p>
</div>
</div>

<div id="outline-container-orgde8c197" class="outline-2">
<h2 id="orgde8c197"><span class="section-number-2">5</span> 结语</h2>
<div class="outline-text-2" id="text-5">
<p>
最开始接触动态代理这个概念是在看《Java 核心技术卷》这本书的时候，当时刚开始学 Java 没多久，看到这个东西后的想法就是，这么不方便的东西，谁没事会去用啊 ‍→_→
</p>

<p>
结果，它的使用很广泛 ‍( ´_ゝ｀)
</p>

<p>
类似的还有源码注解，不得不说，这些操作起来麻烦，但是功能又强大的特性，总会有人完成花样来‍╮(￣▽￣)╭
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">&#33050;&#27880;: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
最开始看到 <code>InvocationHandler</code> 这个接口的时候总以为它的第一个参数为 <code>TargetObject</code>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
为了方便阅读省略了很多其他不必要的内容 
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
版权声明：本作品采用<a rel="license" href="http://creativecommons.org/licenses/by-nc/4.0/">知识共享署名-非商业性使用 4.0 国际许可协议</a>进行许可
<script src="https://utteranc.es/client.js"
        repo="rgb-24bit/blog"
        issue-term="pathname"
        theme="boxy-light"
        crossorigin="anonymous"
        async>
</script>
</div>
</body>
</html>
